cases/openfoam.org/arbitraryRotatingInletACMI/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 -0.10);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    movingWall 
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    wall
    {
        type            noSlip;
    }

    ACMI1_couple
    {
        type            cyclicACMI;
        value           uniform (0 0 0);
    }

    ACMI2_couple
    {
        type            cyclicACMI;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
