cases/openfoam.org/arbitraryRotatingInletACMI/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Patches to create.
patches
(
    {
        //- Master side patch
        name            interfaceOuter;
        patchInfo
        {
            type            wall;
        }
        constructFrom patches;
        patches (interface connected);
    }

    {
        //- Slave side patch
        name            interfaceInner;
        patchInfo
        {
            type            wall;
        }
        constructFrom patches;
        patches (connected_slave);
    }
);

// ************************************************************************* //
